# -*- coding: utf-8 -*-

keyword_dict = {
    '公安类': {
        '其他': [
            ['派出所'], ['公安局'], ['报警中心'], ['警察'], ['报警']
        ]
    },
    '急救类': {
        '其他': [
            ['急救中心'], ['急症中心']
        ]
    },
    '贷款类': {
        '其他':[
            ['贷款'], ['借贷'], ['借钱'],
        ],
        '车贷': [
            ['车贷']
        ],
        '催收': [
            ['催收'],
            ['讨债'],
            ['讨钱'],
            ['讨账'],
            ['追债'],
            ['追款'],
            ['催债'],
            ['催款'],
            ['催账'],
            ['催钱'],
            ['要债'],
            ['债主'],
            ['债权'],
            ['背债'],
            ['收租'],
            ['催租']
        ],
        '抵押类':[
            ['典当'],
            ['当铺'],
            ['抵押']
        ]
    },
    '贷款中介类': {
        '其他': [
            ['假', '征信'], ['改', '征信'], ['洗', '征信'], ['消', '征信'],
            ['清', '征信'], ['屏蔽', '征信'], ['口子', '贷'], ['信贷员']
        ]
    },
    '互联网金融类': {
        '其他': [
            ['拍拍贷'],
            ['拍拍'],
            ['捷信'],
            ['闪银'],
            ['宜人贷'],
            ['宜信'],
            ['佰仟'],
            ['现金巴士'],
            ['平安易贷'],
            ['亲亲小贷'],
            ['陆金所'],
            ['花呗'],
            ['微贷'],
            ['稳安贷'],
            ['你我贷'],
            ['手机贷'],
            ['人人贷'],
            ['钱袋宝'],
            ['我来贷'],
            ['趣分期'],
            ['分期乐'],
            ['借呗'],
            ['随心贷'],
            ['有利网'],
            ['爱投资'],
            ['积木盒子'],
            ['温州贷'],
            ['鑫合汇']
        ]
    },
    '银行类': {
        '其他': [
            ['银行'],
            ['农村信用'],
            ['信用社']
        ]
    },
    '信用卡类': {
        '银行客服': [
            ['银行', '信用卡'],
            ['信用卡中心'],
            ['信用卡', '服务']
        ],
        '黑户办卡': [
            ['办卡'],
            ['黑户']
        ],
        '提额': [
            ['提额', '信用卡']
        ],
        '套现': [
            ['套现'], ['pos']
        ]
    },
    '法律类': {
        '法院': [
            ['法院']
        ],
        '律师': [
            ['律师']
        ],
        '其他':[
            ['律所'], ['法律咨询'], ['法官'], ['司法']
        ]
    },
    '不良习惯类': {
        '赌博类': [
            ['投注'],
            ['彩票'],
            ['赛马'],
            ['乐透'],
            ['赌球'],
            ['赌球']
        ],
        '假证类': [
            ['假证'], ['办证']
        ],
        '其他': [
        	['烟'],['酒']
        ]
    },
    '金融类': {
        '投资理财': [
            ['投资'],
            ['投行'],
            ['利息'],
            ['理财'],
            ['证券'],
            ['信托'],
            ['基金'],
            ['炒股'],
            ['股票'],
            ['外汇'],
            ['黄金'],
            ['保险公司']
        ]
    },
    '房产类': {
        '房产中介': [
            ['链家'],
            ['我爱我家'],
            ['房产', '经纪人'],
            ['房产中介']
        ],
        '其他': [
            ['买房'],
            ['卖房'],
            ['房产', '公司'],
            ['地产'],
            ['楼盘'],
            ['恒大'],
            ['绿城'],
            ['售楼处'],
            ['物业'],
            ['地产'],
            ['房屋']
        ]
    },
    '酒店类': {
        '其他': [
            ['酒店'],
            ['宾馆'],
            ['旅馆'],
            ['旅店'],
            ['旅社'],
            ['山庄'],
            ['住宿'],
            ['驿站'],
            ['客栈'],
            ['招待所'],
            ['度假村'],
            ['度假公寓'],
            ['锦江之星'],
            ['速8'],
            ['速八'],
            ['7天'],
            ['如家'],
            ['格林豪泰'],
            ['汉庭'],
            ['宜必思'],
            ['希尔顿'],
            ['喜来登'],
        ]
    },
    '旅游类': {
        '出行': [
            ['机票'],
            ['航空'],
            ['车站'],
            ['火车'],
            ['车票'],
            ['机场'],
            ['去哪儿'],
            ['携程'],
            ['去啊'],
            ['同程'],
            ['途牛'],
            ['出租车'],
            ['滴滴'],
            ['的士'],
            ['租车'],
            ['专车'],
            ['黑车'],
            ['代驾'],
            ['客车'],
            ['客运'],
            ['汽车']
        ],
        '其他': [
            ['导游'], ['售票处'], ['旅行']
        ]
    },
    '娱乐类': {
        '其他': [
            ['娱乐'],
            ['游戏'],
            ['夜店'],
            ['俱乐部'],
            ['酒吧'],
            ['ktv'],
            ['KTV'],
            ['ＫＴＶ'],
            ['ｋｔｖ'],
            ['娱 乐'],
            ['夜 店'],
            ['俱 乐 部'],
            ['酒 吧'],
            ['量贩式'],
            ['影院'],
            ['网吧'],
            ['网咖'],
            ['赛车'],
            ['影城'],
            ['台球'],
            ['桌游'],
            ['电玩'],
            ['足疗'],
            ['沐足'],
            ['洗浴'],
            ['会所'],
            ['咖啡'],
            ['茶馆'],
            ['剧场'],
            ['棋牌'],
            ['按摩'],
            ['温泉'],
            ['夜总会'],
            ['游乐园'],
            ['密室'],
            ['轰趴']
        ]
    },
    '快递送餐类': {
        '快递': [
            ['物流'],
            ['快递'],
            ['快运'],
            ['速递'],
            ['速运'],
            ['宅急送'],
            ['圆通'],
            ['申通'],
            ['中通'],
            ['汇通'],
            ['国通'],
            ['韵达'],
            ['百世'],
            ['优速'],
            ['全峰'],
            ['顺丰'],
            ['EMS'],
            ['UPS'],
            ['DHL'],
            ['邮政']
        ],
        '送餐': [
            ['送餐'], ['外卖'], ['订餐'], ['饿了么']
        ]
    },
    '医疗类': {
        '其他': [
            ['医院'],
            ['诊所'],
            ['门诊'],
            ['牙科'],
            ['医生'],
            ['医疗'],
            ['美容'],
            ['医药'],
            ['病','看'],
            ['感冒'],
            ['生','病']
        ]
    },
    '美妆类': {
    	'其他': [
    		['口红'],['护肤'],['眼影'],['唇'],['眼线'],['眉'],['面膜'],['屈臣氏'],['精油'],['精华'],['乳液'],['霜'],['膏'],
    		['香奈'],['香水'],['黑管'],['黑瓶'],['红管'],['白管'],['TF'],['dior'],['lobotin'],['chanel'],['mac'],['兰蔻'],
    		['雅诗兰黛'],['ford'],['欧莱雅'],['ysl'],['纪梵希'],['娇兰'],['羊皮'],['圣罗兰'],['风吟'],['德国世家'],['cpb'],['隔离']
    	],
    },
    '生驹里奈': {
    	'其他':[
    		['驹']
    	]
    },
    '推销类': {
        '推销骚扰': [
            ['广告'], ['推销'], ['骚扰'], ['响一声']
        ],
        '诈骗': [
            ['诈骗']
        ]
    },
    '美食类': {
        '餐厅': [
            ['火锅'], ['咖啡厅'], ['自助', '餐'], ['餐厅'], ['料理'], ['鸡排'], ['汤粉'], ['辣', '虾'],
            ['烤鱼'], ['菜馆'], ['水饺'], ['海鲜'], ['家常菜'], ['饺子']
        ],
        '烧烤': [
            ['烤肉'], ['烧烤'] ,['烤', '牛'], ['烤', '羊']
        ],
        '面包甜点': [
            ['面包'], ['甜点'], ['烘焙'], ['奶', '吧'], ['冻', '奶'] ,['果', '茶'], ['饮料']
        ],
        '快餐':[
            ['小吃'], ['快餐'], ['德克士'], ['肯德基'], ['麦当劳'], ['凉面'], ['必胜客'], ['汉堡'],
            ['麻辣烫'], ['披萨'], ['豆浆']
        ],
        '其他':[
        	['月饼'], ['元祖'], ['美心'], ['蛋黄'], ['莲蓉'], ['豆沙'], ['粉'], ['吃']
        ]
    },
    '生活类':{
        '其他': [
            ['摄影'], ['婚纱'], ['鲜花'], ['复印'], ['宠物'], ['数码', '相'], ['照相馆'], ['快印'],
            ['数码', '印'], ['公证处'], ['物业'], ['干洗'], ['彩票'], ['殡仪'], ['殡葬'], ['电信'],
            ['移动'], ['联通'], ['宽带'], ['报刊'], ['杂志'], ['驾校']
        ]
    },
    '运动类':{
        '其他': [
            ['健身房'], ['游泳'], ['瑜伽'], ['篮球'], ['乒乓球'], ['羽毛球'], ['体育', '馆'],
            ['舞蹈'], ['网球'], ['足球'], ['高尔夫'], ['保龄球'], ['武术'], ['体育', '场'],
            ['溜冰'], ['滑雪']
        ]
    },
    '购物类':{
        '超市': [
            ['超市'], ['家乐福'], ['便利店'], ['商店']
        ],
        '商场': [
            ['商城'], ['商场'], ['购物中心'], ['百货']
        ],
        '其他': [
            ['书店'], ['花店'], ['钟表眼镜'], ['市场'], ['批发'], ['户外', '店'], ['买']
        ]
    },
    '教育类':{
        '其他':[
            ['大学'], ['学院'], ['学校'], ['教育'], ['幼儿园'], ['小学'], ['中学'], ['家教'],
            ['老师'], ['教授'], ['留学']
        ]
    }
}